In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
moma_file = "Resources/moma.csv"
moma_df = pd.read_csv(moma_file)
moma_df.head()

        Artist_Name  Birth_Year
0         2x4, Inc.      1994.0
1        A&E Design      1968.0
2  A. F. Gangkofner      1921.0
3    A. G. Fronzoni      1923.0
4   A. Michael Noll      1939.0

In [3]:
artists_file = "Resources/top_500_artists.csv"
artists_df = pd.read_csv(artists_file)
artists_df.head()

            Artist_Name       Turnover  Sold Lots Highest Price  Top_500_Rank
0  Jean-Michel BASQUIAT  $256,098,080         125  $45,315,000              1
1            Peter DOIG  $100,958,125          45  $21,127,500              2
2        Rudolf STINGEL   $52,389,232          27   $7,938,905              3
3          George CONDO   $49,248,967         100   $6,162,500              4
4            CHEN Yifei   $47,201,867          18  $22,640,280              5

In [15]:
merged_df = pd.merge(moma_df, artists_df, how='left', on='Artist_Name')

merged_df.head()

,Artist_Name,Birth_Year,Turnover,Sold Lots,Highest Price,Top_500_Rank
0,"2x4, Inc.",1994.0,NaN,NaN,NaN,NaN
1,A&E Design,1968.0,NaN,NaN,NaN,NaN
2,A. F. Gangkofner,1921.0,NaN,NaN,NaN,NaN
3,A. G. Fronzoni,1923.0,NaN,NaN,NaN,NaN
4,A. Michael Noll,1939.0,NaN,NaN,NaN,NaN

In [8]:
from sqlalchemy import create_engine 
engine=create_engine("mysql+mysqldb://root:"+'root'+"@localhost/entityresolution")

In [9]:
#engine = create_engine("mysql+mysqldb://root@localhost:"+'Datarules1!'+"@LTUSSACPC0JCR4Z:3306/Artist_db")
engine = create_engine("sqlite://", echo=False)

In [12]:
merged_df.to_sql(name='merged_df', con=engine, if_exists='append',index=False)
merged_df.head()

,Artist_Name,Birth_Year,Turnover,Sold Lots,Highest Price,Top_500_Rank
0,"2x4, Inc.",1994.0,NaN,NaN,NaN,NaN
1,A&E Design,1968.0,NaN,NaN,NaN,NaN
2,A. F. Gangkofner,1921.0,NaN,NaN,NaN,NaN
3,A. G. Fronzoni,1923.0,NaN,NaN,NaN,NaN
4,A. Michael Noll,1939.0,NaN,NaN,NaN,NaN